[
  {
    "title": "PNG Set to Bounce on the Big Stage",
    "description": "PORT MORESBY (Papua New Guinea) - The Maikai siblings Adam and Gibella will represent Kikori, their home province (Gulf) and the country for the first time playing for the PNG Under 15s at the FIBA U15 Oceania Championships in Guam.\n\nJoining the Maikai siblings to also make their debut will be 22 other squad members.\n\nFrom the muddy basketball courts of Kikori to cemented courts in Guam is a great achievement not just for the Maikai family but for the whole of Kikori District and probably Gulf Province.\n\nFollowing their mother’s footsteps in basketball, Adam (15) and Gibella (13) grew up playing the sport back in their village.\n\nAdam said his mom inspired him after she returned from the 2017 PNG Games in Kimbe and returned with a bronze medal.\n\nThis inspired him (Adam) and his younger sister to take up the sport at a very young age.\n\nAdam, while playing, did not really have the feel of it until two years ago when his mother, Ella Dodobai, who is currently the Kikori Urban Basketball Association president, hosted Independence games and also Gibella’s birthday celebrations.\n\n“By that time I was 13-years old; I started to love basketball and played every day on the muddy court with my friends.”\n\nAdam said he started learning the basics of basketball from his mother and coaches back in Kikori.\n\n“The first basic skills I remember learning were defensive and dribbling.”\n\nH4H co-coordinator Jordan Sere said at the end of the day basketball is there to inspire, “so what we can do we will do and I’m glad Adam can see that”.\n\n“Adam has shown interest in coaching, he asked me for help and I’ve given him guidance and advice and being a young coach will be a bonus for Kikori and Gulf Province.”\n\nYoung Adam and Gibella also play in the Kikori Urban Basketball Association (KUBA) and recently participated in the U15s and U17s National Championships in which they (KUBA) won the U15s title, with Gibella getting player of the match award.\n\nFrom these championships, both Adam and Gibella were selected.\n\nAdam also thanked all his coaches in Kikori and also Sere for teaching him everything about basketball.\n\nBoth Adam and Gibella will be part of the contingent to travel to Guam this Sunday (November 20).\n\nPost Courier - Megan Fiu Ra'Vu",
    "image": "PNG_set.jpg"
  },
  {
    "title": "Party time for Polkowice at Praha, Meesseman shines in Fenerbahce debut",
    "description": "MUNICH (Germany) - For the second time this season, BC Polkowice have grabbed the headlines by claiming a major scalp after celebrating a fabulous road win at ZVVZ USK Praha.\n\nThe Polish club followed up their impressive opening day dismantling of Fenerbahce Alagoz Holding to improve to 3-1 with an exciting 83-80 victory against another Final Four participant in the Czech capital. The success and the first defeat of the campaign for Praha was built around a stunning performance from the in-form Steph Mavunga.\n\nThe forward collected a colossal double-double of 25 points and 17 rebounds.Polkowice also prospered from making 10 triples in the contest and a nice 18 points from Artemis Spanou. Meanwhile Praha will be kicking themselves for losing their unbeaten record and not least because the visitors had 26 turnovers. Alyssa Thomas had 21 points, 12 rebounds and 6 steals, with Valeriane Vukosavljevic adding 28 points, 6 rebounds and 4 assists. \n\nEmma Meesseman finally got to step out with Fenerbahce Alagoz Holding and she made an immediate impact on her return from injury with a classy showing. Her 20 points, 7 rebounds and 5 assists paced her team's 85-67 triumph at Virtus Segafredo Bologna. ",
    "image": "party_time.jpg"
  },
  {
    "title": "Bangui stun hosts ABC to stay perfect in Elite 16",
    "description": "ABIDJAN (Cote D'Ivoire) - Bangui Sporting Club of Central Africa once again proved that their qualification for the Road to BAL Elite 16 Round was not a fluke as they handed Abidjan Basket Club a 72-67 defeat on Tuesday.\n\nThanks to a late rally and excellent combination between the trio of Jimmy Djimbrabaye, Kenny Gasana and Rolly Fula Tuesday night in Abidjan, Bangui have extended their winning streak to 4-0 in the Road to BAL.\n\nFula rose to the occasion to put the Bangui-based side in front at the resumption of play in the fourth quarter from the charity line.\n\nBut the slime lead (49-48) was cut short by ABC energetic forward Mike Fofana with a dunk off a mistake from Fula over miss calculation in his ball handling, but Djimbrabaye turn around jumper in the paint restore parity for the Coach Alpha Mane tutored Bangui Sporting Club.\n\nThe game progresses with the two teams matching up to each other grit for grit. ABC guard Pacheco Georgie put the home side ahead with a shot from down town with 3:50 minutes left to put the 2005 FIBA Africa Champions Cup winner in front (55-57).\n\nBut Kendall Gray restore parity through a second chance put back and added another two points to put the debutant back in front.\n\nCoach Mane would have the excellent combination of his experience players (Djimbrabaye, Gasana and Fula) to thank for the well deserved victory of the night which takes their tally to 2-0 in the Elite 16 round.\n\nDjimbrabaye posted a double-double of 18 points, 10 rebounds, 7 assists, one block shot and 28 efficiency rating and the trio of Fula, Gray and Morel Lenguewane combined for 33 points to aid their side to a deserved victory while the trio of ABC Fofana (19), James Marquis Alvarez Westbrook (12) and Stephane Konate (11) dug up double figures for their side.\n\nGAME HERO: It was evident that Jimmy Djimbrabaye was the hero of the day, the forward remained undaunted even after getting a technical foul midway into the third he still manage to pull his side through with the most effective performance of the night.\n\nSTATS DON'T LIE: Bangui Sporting Club showed better understanding and game management of the night, they are the better of the two side in offense and defense (72-67) and on the board (53-39).\n\nTURNING POINT:  The turning point of the epic game came at the restart of the third quarter, the Bangui-based side were behind by eight points at halftime (30-38) but reduced the margin to just a point going into the decisive quarter (47-48) but turned things in their favour in the last quarter which they won by 25-19 to record their second win in the West Division.\n\nBOTTOM LINE: Bangui Sporting Club have sealed one of the Semi-Finals spot in Group A even as they still have a game at hand.\n\nEarlier in the day FAP defeated Nueva Era basketball club of Equatorial Guinea by 90-72 points to restore their hope in the Elite 16 round, Elan Coton provided one of the most surprised result as they held down Association Sportive de Sale (62-58) while Stade Malien hold off SLAC by 82-76 points in a win by another debutant.\n\nFIBA ",
    "image": "bangui.jpg"
  },
  {
    "title": "Top performers from Gameday 2 of Window 5",
    "description": "MIAMI (United States) - Window 5 of the FIBA Basketball World Cup 2023 Americas Qualifiers has come to an end, and the top performers from this window stepped up for their national teams in crucial games.\n\nAs we say goodbye to the last window of 2022 before attention gets turned to the final window in February 2023, let's look at who stood out on Gameday 2 of Window 5.\n\nBruno Caboclo, who was also named to the top performers from Gameday 1 of Window 5, once again made the top five after finishing with 16 points, 10 rebounds, 2 assists and 2 blocks in Brazil's big 102-56 win over Mexico, as they wrapped up the window 2-0 to move into second place in Group F.Canada continued their dominance in the qualifiers, as they remained unbeaten at 10-0 in Group E. Aaron Best had a breakout game in a 112-71 blowout of Panama, recording 22 points, 2 rebounds and 2 steals on an efficient 6-of-9 shooting from three-point.\n\nUSA remained on top of Group F after going 1-1 in the window, grabbing an 88-81 win over Colombia with the help of David Stockton, who finished tied with a team-high 23 points along with 3 assists on 7-of-11 shooting from the field and 3-of-6 shooting from three-point range. This was his highest scoring game in his six qualifying games.\n\nMichaell Jackson had his best game of the Americas Qualifiers, playing in his 10th game across all the windows, but could not prevent a narrow 88-81 loss to USA. The 35-year-old finished with 25 points, 10 rebounds, 3 assists and 2 steals on 6-of-12 shooting from the field and a perfect 11-of-11 from the free-throw line, as well as the highest efficiency rating of Gameday 2 (31).\n\nRounding out the list of top performers is Uruguay veteran center Esteban Batista. The 39-year-old, who's been a familiar face for the national team, recorded a game-high 19 points, 16 rebounds (his highest in the qualifiers) and 3 assists in a 76-68 loss to Puerto Rico.\n\nFIBA",
    "image": "performers.jpg"
  },
  {
    "title": "Afuwape's 19 points give Elan Coton hope in Elite 16",
    "description": "ABIDJAN (Cote D'Ivoire) - Micheal Afuwape ignited Elan Coton to a famous Road to BAL Elite 16 win on Tuesday evening as the Benin champions beat AS Sale 62-58.\n\nAfuwape had a 7-for-10 shooting to lead the way with 19 points, 6 rebounds and 6 steals, in  a win that gives Elan Coton hope of competing for a place in the Basketball Africa League (BAL). \n\nThe Road to BAL debutant Elan Coton pulled off the biggest surprise of Day in Abidjan as they erased a 16-point halftime deficit (38-22) to humble former Africa Champions Cup winner, Association Sportive de Sale.Speaking with FIBA.basketball captain of the Cotonou-based side, Arnold Yacoubou that determination of not getting eliminated early spurred them on in the second half.\n\nThe former Union Bank basketball club of Lagos, Nigeria forward further hinted that they sized up the Moroccan and came to the conclusion that they can be beaten.\n\nThe 1.96 (6ft 5in) forward gave kudos to his teammates and coaching crew led by Coach Gilles Kouamo for the wonderful halftime locker room pep talk.\n\n\"We knew we were the underdog before the jump ball and [the] Moroccan side took advantage of that to race to halftime lead of 38-22 points but we came out of the locker room after the break and decided to apply new strategy to our style of play and this paid off.\n\n\"Honestly I don't know how to express myself because of the big win over AS Sale and we apply the same strategy and energy against Bangui Sporting Club in our last group game on Wednesday,\" Yacoubou concluded.\n\nOn his part 206m (6ft 9in) forward Robert Gilchrist told FIBA.basketball that his side is on a mission in Abidjan.",
    "image": "Afuwape.jpg"
  },
  {
    "title": "Number 6: Snytsina becomes newest member of the 1000-point club",
    "description": "MUNICH (Germany) - The EuroCup Women 1000-point club is an exclusive one that has welcomed a new member this season.\n\nJust five players had broken the milestone in the competition's history before Katsiaryna Snytsina became the sixth to do so earlier this month, also surpassing Gunta Basko to move into fifth place in the all-time standings.\"Position 4? Why not? We will see. I will just enjoy and do my best and give everything on the court,\" Snytsina said via London Lions. \"Sometimes I can't believe that this is my season number 20, but at the same time I'm enjoying it. Everyday I love basketball.\"\n\nHere's a closer look at the players to have achieved the feat:\n\n6. Gunta BASKO - 1,002 points\"Position 4? Why not? We will see. I will just enjoy and do my best and give everything on the court,\" Snytsina said via London Lions. \"Sometimes I can't believe that this is my season number 20, but at the same time I'm enjoying it. Everyday I love basketball.\"\n\nHere's a closer look at the players to have achieved the feat:\n\n6. Gunta BASKO - 1,002 pointsFORWARD\nBirth Date: September 2, 1982\nNationality: BLR\nHeight: 1.88m (6ft 2in)\n\nEuroCup Women Clubs: London Lions (GBR); Nesibe Aytin (TUR); Hatay (TUR); DVTK (HUN); Tarsus (TUR); BC Chevakata (RUS); Nadezhda (RUS)\n\nGames Played: 83\nStatistics: 12.2 PTS, 3.7 REB, 2.5 AST\n\nThe 37-year-old veteran not only passed 1000 points in the competition this season, but also climbed into the top five of the all-time leading scorers. Snytsina is now part of the London Lions in giving the British side some valuable experience on the European stage. The Belarusian has also won a medal at international level in 2007 and played across Europe for clubs in Turkey, Russia and Hungary with the sharpshooter a consistent performer with solid career numbers in EuroCup Women with a chance to climb higher up the leaderboard.\n\n4. Marina BAS - 1,097 pointsFORWARD\nBirth Date: July 19, 1985\nNationality: RUS\nHeight: 1.94m (6ft 4in)\n\nEuroCup Women Clubs: Nadezhda (RUS); WBC Dynamo (RUS); Hatay (TUR); Lointek Gernika Bizkaia (ESP); Umea Udominate (SWE); Botas (TUR)\n\nGames Played: 73\nStatistics: 15.1 PTS, 6.8 REB, 1.6 BLK\n\nA veteran of the competition, Bas has no fewer than nine seasons in the competition under her belt. Highly competitive and and able to put points on the board thanks to her extended shooting range, the forward is perhaps one of the most underrated and under-recognized stars of the modern era. After all, she is a double Olympian, winning a bronze medal in 2008. She also played at five different FIBA Women's EuroBasket Final Round tournaments with Russia - including a memorable gold in 2011, plus silver medals in both 2005 and 2009.\n\n3. Courtney PARIS - 1,108 pointsCENTER\nBirth Date: September 21, 1987\nNationality: USA\nHeight: 1.90m (6ft 2in)\n\nEuroCup Women Clubs: Botas (TUR); Mersin (TUR); Istanbul Universitesi BGD (TUR); Hatay (TUR); Orman Genclik (TUR)\n\nGames Played: 71\nStatistics: 15.6 PTS, 13.7 REB, 1.5 AST\n\nThe powerhouse center has been dominant in this competition from the moment she took to the floor and debuted with Botas. She has been unstoppable in the paint and it has not only been the sheer number of points she has scored to make the all-time top three, but also the fact that she has done it with a brilliant points per game average - as part of a spectacular career double-double in the tournament.\n\n2. Michelle SNOW - 1,218 pointsCENTER\nBirth Date: March 20, 1980\nNationality: USA\nHeight: 1.96m (6ft 5in)\n\nEuroCup Women Clubs: Ramat Hasharon (ISR); WBC Dynamo (RUS); Lavezzini Parma (ITA); Dynamo Kursk (RUS); Adana Botas (TUR); Mersin (TUR)\n\nGames Played: 83\nStatistics: 14.7 PTS, 9.8 REB, 1.9 AST\n\nStrong and commanding in the paint, Snow was a relentless machine at times, with her quality demonstrated not only by this second spot in the chart, but also by the fact she only just missed out on averaging a double-double during her storied EuroCup Women career. A particular high point for Snow came when she picked up a winners' medal with Dynamo Kursk in 2012.\n\n1. Shay DORON - 1,256 pointsGUARD\nBirth Date: April 1, 1985\nNationality: ISR\nHeight: 1.75m (5ft 9in)\n\nEuroCup Women Clubs: Elitzur Ramla (ISR); Besiktas (ISR); Municipal Targoviste (ROU); Dynamo Kursk (RUS); Maccabi Bnot (ISR)\n\nGames Played: 80\nStatistics: 15.7 PTS, 2.8 REB, 2.4 AST, 2.1 STL\n\nA scoring machine whenever she was wearing an Israel national team vest or for one of five different EuroCup Women clubs, Doron was a constant threat whenever she was on the floor. A nightmare for the opposing defense, the guard was prolific and proudly takes top spot in the all-time list. She was proudly crowned champion of the competition while standing out for Elitzur Ramla in 2011 - the only time an Israeli club has ever won the title.",
    "image": "Number.jpg"
  },
  {
    "title": "2022 Class of FIBA Hall of Fame: Milan 'Ciga' Vasojevic",
    "description": "MIES (Switzerland) - Revered Serbian playcaller Milan 'Ciga' Vasojevic is having his impressive coaching accomplishments and legacy recognized via a posthumous induction to the FIBA Hall of Fame.\n\nVasojevic is being enshrined in the Class of 2022 as part of a nine-strong group that have all contributed significantly to the development of women's basketball.\n\nThe Class also includes deserved recognition for a number of others coaches including Geno Auriemma (USA), Antonio Barbosa (Brazil) and Maria Planas (Spain). The remainder of the inductees are honored for their efforts on the court, with the player inductees made up from Lisa Leslie (USA), Robyn Maher (Australia), Catarina Pollini (Italy), Jurgita Streimikyte-Virbickiene (Lithuania) and Mame Maty Mbengue (Senegal).Vasojevic's coaching roots were initially sown in the men's game and at Radnicki Belgrade during  the 1970's, he came mightily close to leading them to Cup Winners Cup glory. But, they were agonizingly squeezed out 87-86 in the 1977 Final by Cantu of Italy.\n\nSwitching to the women's game, his arrival as the head coach of the Yugoslavia national team in 1980 sparked a truly halcyon period, with his impact on the team huge from the outset.\n\nIndeed, he delivered instant success in what many in his homeland saw as something of a revolution in the way that he changed the generations and put faith in young and dynamic players.\n\nDuring his first year at the helm, he led the team to history by delivering Yugoslavia a first ever Olympic medal. They took bronze at the Moscow Games, coming out 68-65 against Hungary in a dramatic Third Place Game. His amazing first few months in charge continued when he stepped out for his maiden FIBA Women's Eurobasket. He made sure the host nation got onto the podium again as Yugoslavia secured a bronze medal at the event. \n\nThe next major milestone that made everyone sit up and take notice was at the 1987 University Games when he led the Yugoslavia women's team to its first ever senior international gold medal - more poignant as it was won in Zagreb.\n\nA matter of weeks later and Yugoslavia made the FIBA Women's EuroBasket Final in Spain, taking the silver medal and equalling their best ever finish after being eased out 83-73  by a dominant Soviet Union. \n\nBy the 1988 Olympics in Seoul, Yugoslavia were in full flow and packed with some amazing talent and eyeing up history. Improving on their bronze medal from Moscow back in 1980 was the aim. Vasojevic came up with the goods for his country, masterminding a run to their first ever title game.",
    "image": "2022.png"
  },
  {
    "title": "Third Secretary General Patrick Baumann led modernization of FIBA\n",
    "description": "MIES (Switzerland) - Through the passing of time, the legacy of an individual becomes clearer for all to see.\n\nThe fruits of Patrick Baumann's labor were evident long before his sudden passing in 2018, when he died unexpectedly at just 51 years of age.\n\nAs part of the celebration of 90 Iconic Moments of FIBA, we remember Baumann, a true visionary and leader whose expertise helped many organizations, including the International Olympic Committee.Following his appointment in 2002 as the third FIBA Secretary General, after Dr. William Jones and Borislav Stankovic, Baumann became a mover and shaker in the sport of basketball. Open to innovation and change that strengthened the sport and made it more popular and accessible, he presided over FIBA at a time of unprecedented growth.\n\nHe helped FIBA modernize. He oversaw radical changes FIBA had needed to its governance structure.\n\nFIBA's construction, and ultimate relocation, to its own state-of-the-art headquarters outside of Geneva, was symbolic of the fresh and healthy approach that he brought to basketball's world governing body. His impact and popularity were so profound that in his honor, FIBA's headquarters in Mies was renamed the Patrick Baumann House of Basketball.",
    "image": "third.png"
  },
  {
    "title": "Samoa determined on journey to being a Tier-1 team",
    "description": "MANGILAO (Guam) - The high-level of determination of the girls from Samoa is not something that we haven’t seen.\n\nEarlier in June, the Samoa national team had already generated buzz by winning the FIBA U16 Women’s Asian Championship 2022 in Jordan. The team had overcome two early losses to Syria and the Philippines, only to come back and beat those two same teams in the Semi-Finals and Final, respectively.\n\n\"[My goal for] Samoa basketball is to become as big as Australia's basketball and to encourage more girls to keep playing basketball,\" said Samoa stand out Azaleeah Oloapu at the time.\n\nThere’s a similar sense of determination here within the team that will be playing at the FIBA U15 Oceania Championship 2022, at least from Azaniah Afualo.\n\n\"My expectations for this event is that it will contribute to the journey of making Samoa a tier-1 team and to qualify for Division A from the U16 Women’s Asian Championship 2023. What I expect to experience is playing out of position and facing new and different game scenarios. However, I am excited for these challenges as people only improve through getting out of their comfort zone.\"\n\nIt seems like big ambitions for Samoa who are currently unranked in both the FIBA World Ranking in both Women’s and Girl’s category, but it might not be too much to imagine considering what the program has been able to achieve just in this calendar year.\n\nIn 2022, Samoa has already finished in 4th place in the U18 Women’s Asian Championship and, as mentioned above, won the U16 Women’s Asian Championship.\n\nThere’s still quite a journey to go through before reaching the expectation set by Afualo, but it’s definitely refreshing to know that the 15-year-old has such high ambitions.\n\nAnd it shouldn’t come as a surprise considering how much pride she takes in being a part of the national team program.\n\n\"Being able to represent Samoa means so much. It’s always been a dream to represent at this level,\" she said. \"All I knew is that I wanted to experience an event as such to help me further develop my basketball intelligence, skill and love for the game. Now having the opportunity to represent my motherland on such a big stage gives me pride, as I get to learn and share more about my beautiful culture whilst playing the game I love most.\"\n\nAt the U15 Oceania Championship in Guam, Samao and Afualo will be going up against the likes of Papua New Guinea and Northern Mariana Islands as well as New Zealand and Australia.\n\n\"It’s a huge honor,\" said Afualo of being a part of the upcoming competition. \"Having the opportunity to represent a nation let alone my motherland is such a blessing to receive. I feel stoked knowing that I’ll experience such an awesome event with such humble and hard working athletes, and consider myself very lucky to be under the care of brilliant coaches who dedicate so much time to everyone’s development.\"\n\nIt’s easy to feel from what Afualo says about playing for Samao and at the U15 Oceania Championship how much basketball means for her.\n\n\"I first began to play when I was 8 years of age where I played my first game in junior league. However, I had always been to many mini ball camps, workshops and trainings prior to playing my first game.\"\n\n\"Basketball has always been a part of my life from a young age.\"\n\nYet, it was only until recently when she decided to really take the game more seriously.\n\n\"My main turning point was the end of last year. My family and I experienced one of the greatest challenges in our lives, which really forced me to reflect on the important aspects of my life,\" she revealed.\n\n\"This is where I promised myself to focus purely on my own development, no matter how fast or slow the progress, and that I would be patient and kind to myself. I applied this to basketball, and what I found was beyond anything I could’ve hoped to experience. I finally understood that the more I put in, the more I’ll get out of it and this helped me trust and believe in myself more.\"\n\n\"This is when I realized I wanted to play internationally for a team I’d be proud to represent. I would’ve never known that I’d be given this opportunity so soon and I praise God for such an amazing gift.\"\n\nThat team is the Samoa national team which Azaniah Afualo will be representing at the U15 Oceania Championship 2022. We’ll get to see how far she and the team will go, but judging from what we’ve seen from Samoa in the recent months, it’s safe to that we’ll see them trying their best to prove how good they can be.\n\nFIBA",
    "image": "samoa.jpg"
  }
]